nxp-mcuxpresso/mcux-soc-svd/LPC55S26/LPC55S26.xml
        <register>
          <name>CMDH3</name>
          <description>ADC Command High Buffer Register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPEN</name>
              <description>Compare Function Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMPEN_0</name>
                  <description>Compare disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMPEN_2</name>
                  <description>Compare enabled. Store on true.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMPEN_3</name>
                  <description>Compare enabled. Repeat channel acquisition (sample/convert/compare) until true.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAIT_TRIG</name>
              <description>Wait for trigger assertion before execution.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAIT_TRIG_0</name>
                  <description>This command will be automatically executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_TRIG_1</name>
                  <description>The active trigger must be asserted again before executing this command.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LWI</name>
              <description>Loop with Increment</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LWI_0</name>
                  <description>Auto channel increment disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LWI_1</name>
                  <description>Auto channel increment enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS</name>
              <description>Sample Time Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STS_0</name>
                  <description>Minimum sample time of 3 ADCK cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_1</name>
                  <description>3 + 21 ADCK cycles; 5 ADCK cycles total sample time.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_2</name>
                  <description>3 + 22 ADCK cycles; 7 ADCK cycles total sample time.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_3</name>
                  <description>3 + 23 ADCK cycles; 11 ADCK cycles total sample time.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_4</name>
                  <description>3 + 24 ADCK cycles; 19 ADCK cycles total sample time.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_5</name>
                  <description>3 + 25 ADCK cycles; 35 ADCK cycles total sample time.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_6</name>
                  <description>3 + 26 ADCK cycles; 67 ADCK cycles total sample time.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_7</name>
                  <description>3 + 27 ADCK cycles; 131 ADCK cycles total sample time.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGS</name>
              <description>Hardware Average Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVGS_0</name>
                  <description>Single conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_1</name>
                  <description>2 conversions averaged.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_2</name>
                  <description>4 conversions averaged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_3</name>
                  <description>8 conversions averaged.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_4</name>
                  <description>16 conversions averaged.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_5</name>
                  <description>32 conversions averaged.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_6</name>
                  <description>64 conversions averaged.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_7</name>
                  <description>128 conversions averaged.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOP</name>
              <description>Loop Count Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOOP_0</name>
                  <description>Looping not enabled. Command executes 1 time.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_1</name>
                  <description>Loop 1 time. Command executes 2 times.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_2</name>
                  <description>Loop 2 times. Command executes 3 times.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_3</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_4</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_5</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_6</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_7</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_8</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_9</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_10</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_11</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_12</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_13</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_14</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_15</name>
                  <description>Loop 15 times. Command executes 16 times.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXT</name>
              <description>Next Command Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_0</name>
                  <description>No next command defined. Terminate conversions at completion of current command. If lower priority trigger pending, begin command associated with lower priority trigger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_1</name>
                  <description>Select CMD1 command buffer register as next command.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_2</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_3</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_4</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_5</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_6</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_7</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_8</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_9</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_10</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_11</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_12</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_13</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_14</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_15</name>
                  <description>Select CMD15 command buffer register as next command.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
