nxp-mcuxpresso/mcux-soc-svd/LPC55S26/LPC55S26.xml
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB0_NEEDCLK</name>
              <description>USB Full Speed Controller Clock request interrupt.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB0_IRQ</name>
              <description>USB Full Speed Controller interrupt.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC_IRQ</name>
              <description>RTC_LITE0_ALARM_IRQ, RTC_LITE0_WAKEUP_IRQ</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAILBOX_IRQ</name>
              <description>Mailbox interrupt.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
